package store

import camp.nextstep.edu.missionutils.test.Assertions.assertNowTest
import camp.nextstep.edu.missionutils.test.Assertions.assertSimpleTest
import camp.nextstep.edu.missionutils.test.NsTest
import org.assertj.core.api.Assertions.assertThat
import org.junit.jupiter.api.BeforeEach
import org.junit.jupiter.api.Test
import java.time.LocalDate

class ApplicationTest : NsTest() {
    @Test
    fun `파일에 있는 상품 목록 출력`() {
        assertSimpleTest {
            run("[물-1]", "N", "N")
            assertThat(output()).contains(
                "- 콜라 1,000원 10개 탄산2+1",
                "- 콜라 1,000원 10개",
                "- 사이다 1,000원 8개 탄산2+1",
                "- 사이다 1,000원 7개",
                "- 오렌지주스 1,800원 9개 MD추천상품",
                "- 오렌지주스 1,800원 재고 없음",
                "- 탄산수 1,200원 5개 탄산2+1",
                "- 탄산수 1,200원 재고 없음",
                "- 물 500원 10개",
                "- 비타민워터 1,500원 6개",
                "- 감자칩 1,500원 5개 반짝할인",
                "- 감자칩 1,500원 5개",
                "- 초코바 1,200원 5개 MD추천상품",
                "- 초코바 1,200원 5개",
                "- 에너지바 2,000원 5개",
                "- 정식도시락 6,400원 8개",
                "- 컵라면 1,700원 1개 MD추천상품",
                "- 컵라면 1,700원 10개"
            )
        }
    }

    @Test
    fun `여러 개의 일반 상품 구매`() {
        assertSimpleTest {
            run("[비타민워터-3],[물-2],[정식도시락-2]", "N", "N")
            assertThat(output().replace("\\s".toRegex(), "")).contains("내실돈18,300")
        }
    }

    @Test
    fun `일반 상품 여러 번 구매`() {
        assertSimpleTest {
            run("[비타민워터-3]", "N", "Y", "[물-2]", "N", "Y","[정식도시락-2]", "N", "N")
            assertThat(output().replace("\\s".toRegex(), "")).contains("")
        }
    }

    @Test
    fun `여러 개의 일반 상품 구매 후 멤버쉽 할인`() {
        assertSimpleTest {
            run("[비타민워터-3],[물-2],[정식도시락-2]", "Y", "N")
            assertThat(output().replace("\\s".toRegex(), "")).contains("내실돈12,810")
        }
    }

    @Test
    fun `한 가지 프로모션 상품 구매`() {
        assertSimpleTest {
            run("[콜라-3]", "N", "N")
            assertThat(output().replace("\\s".toRegex(), "")).contains("행사할인-1,000멤버쉽할인-0내실돈2,000")
        }
    }

    @Test
    fun `기간에 해당하지 않는 프로모션 적용`() {
        assertNowTest({
            run("[감자칩-2]", "N", "N")
            assertThat(output().replace("\\s".toRegex(), "")).contains("내실돈3,000")
        }, LocalDate.of(2024, 2, 1).atStartOfDay())
    }

    @Test
    fun `예외 테스트`() {
        assertSimpleTest {
            runException("[컵라면-12]", "N", "N")
            assertThat(output()).contains("[ERROR] 재고 수량을 초과하여 구매할 수 없습니다. 다시 입력해 주세요.")
        }
    }

//    @Test
//    fun `실행 결과 예시`() {
//        assertSimpleTest {
//            run("[콜라-3],[에너지바-5]", "Y", "Y", "[콜라-10]", "Y", "N", "Y", "[오렌지주스-1]", "Y", "Y", "N")
//            assertThat(output().replace("\\s".toRegex(), "")).contains("안녕하세요.W편의점입니다.현재보유하고있는상품입니다.-콜라1,000원10개탄산2+1-콜라1,000원10개-사이다1,000원8개탄산2+1-사이다1,000원7개-오렌지주스1,800원9개MD추천상품-오렌지주스1,800원재고없음-탄산수1,200원5개탄산2+1-탄산수1,200원재고없음-물500원10개-비타민워터1,500원6개-감자칩1,500원5개반짝할인-감자칩1,500원5개-초코바1,200원5개MD추천상품-초코바1,200원5개-에너지바2,000원5개-정식도시락6,400원8개-컵라면1,700원1개MD추천상품-컵라면1,700원10개구매하실상품명과수량을입력해주세요.(예:[사이다-2],[감자칩-1])멤버십할인을받으시겠습니까?(Y/N)==============W편의점================상품명수량금액콜라33,000에너지바510,000=============증정===============콜라1====================================총구매액813,000행사할인-1,000멤버십할인-3,000내실돈9,000감사합니다.구매하고싶은다른상품이있나요?(Y/N)안녕하세요.W편의점입니다.현재보유하고있는상품입니다.-콜라1,000원7개탄산2+1-콜라1,000원10개-사이다1,000원8개탄산2+1-사이다1,000원7개-오렌지주스1,800원9개MD추천상품-오렌지주스1,800원재고없음-탄산수1,200원5개탄산2+1-탄산수1,200원재고없음-물500원10개-비타민워터1,500원6개-감자칩1,500원5개반짝할인-감자칩1,500원5개-초코바1,200원5개MD추천상품-초코바1,200원5개-에너지바2,000원재고없음-정식도시락6,400원8개-컵라면1,700원1개MD추천상품-컵라면1,700원10개구매하실상품명과수량을입력해주세요.(예:[사이다-2],[감자칩-1])현재콜라4개는프로모션할인이적용되지않습니다.그래도구매하시겠습니까?(Y/N)멤버십할인을받으시겠습니까?(Y/N)==============W편의점================상품명수량금액콜라1010,000=============증정===============콜라2====================================총구매액1010,000행사할인-2,000멤버십할인-0내실돈8,000감사합니다.구매하고싶은다른상품이있나요?(Y/N)안녕하세요.W편의점입니다.현재보유하고있는상품입니다.-콜라1,000원재고없음탄산2+1-콜라1,000원7개-사이다1,000원8개탄산2+1-사이다1,000원7개-오렌지주스1,800원9개MD추천상품-오렌지주스1,800원재고없음-탄산수1,200원5개탄산2+1-탄산수1,200원재고없음-물500원10개-비타민워터1,500원6개-감자칩1,500원5개반짝할인-감자칩1,500원5개-초코바1,200원5개MD추천상품-초코바1,200원5개-에너지바2,000원재고없음-정식도시락6,400원8개-컵라면1,700원1개MD추천상품-컵라면1,700원10개구매하실상품명과수량을입력해주세요.(예:[사이다-2],[감자칩-1])현재오렌지주스은(는)1개를무료로더받을수있습니다.추가하시겠습니까?(Y/N)멤버십할인을받으시겠습니까?(Y/N)==============W편의점================상품명수량금액오렌지주스23,600=============증정===============오렌지주스1====================================총구매액23,600행사할인-1,800멤버십할인-0내실돈1,800감사합니다.구매하고싶은다른상품이있나요?(Y/N)")
//        }
//    }


    override fun runMain() {
        main()
    }
}
